# homebrew bundle for a fresh macos setup.
# install everything with: brew bundle --file=Brewfile

# taps
tap "go-swagger/go-swagger"

# dotfile manager (required by this repo)
brew "chezmoi"

# core cli
brew "git"
brew "git-lfs"
brew "gh"
brew "jq"
brew "tree"
brew "colordiff"
brew "coreutils"
brew "ripgrep"

# languages and runtimes
brew "go"
brew "node"
brew "nvm"
brew "python@3.12"

# editors
brew "neovim"
brew "tree-sitter"
brew "lazygit"

# containers and vms
brew "colima"
brew "docker"
brew "docker-compose"
brew "lima"
brew "qemu"

# zsh plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# terminal emulator and font
cask "kitty"
cask "font-jetbrains-mono-nerd-font"
brew "act"
brew "bfg"
brew "brotli"
brew "ca-certificates"
brew "caddy"
brew "certifi"
brew "delve"
brew "dive"
brew "docker-buildx"
brew "docker-completion"
brew "docker-credential-helper"
brew "ffmpeg"
brew "fmt"
brew "freetype"
brew "git-sizer"
brew "glfw"
brew "glib"
brew "glslang"
brew "glslviewer"
brew "gnupg"
brew "gnutls"
brew "go-swagger"
brew "gpgme"
brew "graphviz"
brew "helm"
brew "jupyterlab"
brew "just"
brew "kompose"
brew "libarchive"
brew "libb2"
brew "libssh"
brew "libtermkey"
brew "make"
brew "gradle"
brew "minio-mc"
brew "mongosh"
brew "openjdk@17"
brew "pnpm"
brew "podman"
brew "poetry"
brew "pyenv"
brew "python-yq"
brew "redis"
brew "shellcheck"
brew "sshs"
brew "stow"
brew "telnet"
brew "uv"
brew "watch"
brew "wget"
brew "xclip"
brew "yarn"
brew "yq"
cask "alt-tab"
cask "dotnet-sdk"
cask "git-credential-manager"
