# homebrew bundle for a fresh macos setup.
# install everything with: brew bundle --file=Brewfile

# dotfile manager (required by this repo)
brew "chezmoi"

# core cli
brew "git"
brew "git-lfs"
brew "gh"
brew "jq"
brew "tree"
brew "colordiff"
brew "coreutils"
brew "ripgrep"

# languages and runtimes
brew "go"
brew "node"
brew "nvm"
brew "python@3.12"

# editors
brew "neovim"
brew "tree-sitter"
brew "lazygit"

# containers and vms
brew "colima"
brew "docker"
brew "docker-compose"
brew "lima"
brew "qemu"

# zsh plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# terminal emulator and font
cask "kitty"
cask "font-jetbrains-mono-nerd-font"
